# YOLO11-DAU (Ablation: remove CA & CBAM-S, reindex layers)

nc: 10
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                           # 0-P1/2
  - [-1, 1, ESADConv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]

  - [-1, 1, ESADConv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]

  - [-1, 1, Conv, [512, 3, 2]]                         # 5S-P4/16
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [1024, 3, 2]]                        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]

  - [-1, 1, SPPF, [1024, 5]]                           # 9
  - [-1, 2, C2PSA, [1024]]                             # 10
head:
  # ============ Top-Down Layer 3 (P5 -> P4) ============
  - [-1, 1, Conv, [1024, 1, 1]]#11
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12: Upsample P5

  # [榛勮壊妗?P4]
  - [6, 1, Conv, [512, 1, 1]]                   # 13: 1x1 Conv on Backbone P4 (鐢ㄤ簬鍚庣画缁胯壊铏氱嚎杩炴帴)

  - [[-1, 12], 1, Concat, [1]]                  # 14: Concat (1x1_P4 + Upsampled_P5)
  - [-1, 2, C3k2, [512, False]]                 # 15: Neck P4 Output


  # ============ Top-Down Layer 2 (P4 -> P3) ============
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16: Upsample Neck P4

  # [榛勮壊妗?P3]
  - [4, 1, Conv, [512, 1, 1]]                   # 17: 1x1 Conv on Backbone P3 (鐢ㄤ簬鍚庣画缁胯壊铏氱嚎杩炴帴)

  - [[-1, 16], 1, Concat, [1]]                  # 18: Concat (1x1_P3 + Upsampled_P4)
  - [-1, 2, C3k2, [256, False]]                 # 19: Neck P3 Output


  # ============ Top-Down Layer 1 (P3 -> P2) ============
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20: Upsample Neck P3

  # [鏂板: 榛勮壊妗?P2] (杩欓噷鏄綘瑕佹眰鐨勪慨鏀圭偣)
  - [2, 1, Conv, [256, 1, 1]]                   # 21: 1x1 Conv on Backbone P2

  - [[-1, 20], 1, Concat, [1]]                  # 22: Concat (1x1_P2 + Upsampled_P3)
  - [-1, 2, C3k2, [128, False]]                 # 23: Neck P2 Output


  # ============ P2 Head Branch (Green Box) ============
  # [缁胯壊妗?Attention]



  # ============ Bottom-Up Layer 1 (P2 -> P3) ============
  - [23, 1, Conv, [128, 3, 2]]                  # 25: Downsample P2

  # Concat 涓夎矾杈撳叆:
  # 1. 褰撳墠灞?(-1, 鍗?P2涓嬮噰鏍?
  # 2. Neck P3 (18)
  # 3. Backbone P3 1x1 (16) <--- 瀵瑰簲鍥句腑缁胯壊铏氱嚎
  - [[-1, 17, 19], 1, Concat, [1]]              # 26: 3-Way Concat

  - [-1, 2, C3k2, [256, False]]                 # 27: P3 Output (To Detect)


  # ============ Bottom-Up Layer 2 (P3 -> P4) ============
  - [-1, 1, Conv, [256, 3, 2]]                  # 28: Downsample P3

  # Concat 涓夎矾杈撳叆:
  # 1. 褰撳墠灞?(-1, 鍗?P3涓嬮噰鏍?
  # 2. Neck P4 (14)
  # 3. Backbone P4 1x1 (12) <--- 瀵瑰簲鍥句腑缁胯壊铏氱嚎
  - [[-1, 13, 15], 1, Concat, [1]]              # 29: 3-Way Concat

  - [-1, 2, C3k2, [512, False]]                 # 30: P4 Output (To Detect)


  # ============ Detect Head ============
  - [[23, 26, 29], 1, RDC_Head, [nc]]             # 31: Detect Inputs [P2_Attn, P3, P4]
