# TPH-style YOLO with C3STR for Ultralytics
# Compatible with Ultralytics YOLOv8/YOLOv11-style parser

# Parameters
nc: 80  # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 3, C3, [128]]                # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 6, C3, [256]]                # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 9, C3, [512]]                # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 3, C3, [1024]]               # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9

head:
  - [-1, 1, Conv, [512, 1, 1]]        # 10
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 11
  - [[-1, 6], 1, Concat, [1]]         # 12 cat backbone P4
  - [-1, 3, C3, [512, False]]         # 13

  - [-1, 1, Conv, [256, 1, 1]]        # 14
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 15
  - [[-1, 4], 1, Concat, [1]]         # 16 cat backbone P3
  - [-1, 3, C3, [256, False]]         # 17 P3/8-small

  - [-1, 1, Conv, [128, 1, 1]]        # 18
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 19
  - [[-1, 2], 1, Concat, [1]]         # 20 cat backbone P2
  - [-1, 2, C3STR, [128, False]]      # 21 P2/4-xsmall

  - [-1, 1, Conv, [128, 3, 2]]        # 22
  - [[-1, 18, 4], 1, Concat, [1]]     # 23 cat head P3
  - [-1, 2, C3STR, [256, False]]      # 24 P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]        # 25
  - [[-1, 14, 6], 1, Concat, [1]]     # 26 cat head P4
  - [-1, 2, C3STR, [512, False]]      # 27 P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]        # 28
  - [[-1, 10], 1, Concat, [1]]        # 29 cat head P5
  - [-1, 2, C3STR, [1024, False]]     # 30 P5/32-large

  - [[21, 24, 27, 30], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)