# YOLO11-DAU (Ablation: remove CA & CBAM-S, reindex layers)

nc: 10
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0: Stem (P1/2)
  - [-1, 1, Conv, [128, 3, 2]]       # 1: P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3: P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]       # 5: P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]      # 7: P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

head:
  # top-down layer3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11: P5 -> P4
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 2, C3k2, [512, False]]                 # 13

  # top-down layer2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14: P4 -> P3
  - [[-1, 4], 1, Concat, [1]]                   # 15
  - [-1, 2, C3k2, [256, False]]                 # 16

  # top-down layer1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17: P3 -> P2
  - [[-1, 2], 1, Concat, [1]]                   # 18
  - [-1, 2, C3k2, [128, False]]                 # 19
  - [-1, 1, DynamicAttention, []]               # 20: 动态注意力模块用于浅层特征增强# P2

  # Bottom-up layer1
  - [-1, 1, Conv, [128, 3, 2]]                  # 21: P2 -> P3
  - [[-1, 16], 1, Concat, [1]]                  # 22
  - [-1, 2, C3k2, [256, False]]                 # 23  # P3

  # Bottom-up layer2
  - [-1, 1, Conv, [256, 3, 2]]                  # 24: P3 -> P4
  - [[-1, 13], 1, Concat, [1]]                  # 25
  - [-1, 2, C3k2, [512, False]]                 # 26  # P4


  # Detect heads (P1, P2, P3)
  - [[20, 23, 26], 1, RDC_Head, [nc]]            # 27