# YOLO11-DAU (Ablation: remove CA & CBAM-S, reindex layers)

nc: 10
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                           # 0-P1/2
  - [-1, 1, SADEConv, [128, 3, 2, softmax, 1.0]]
  - [-1, 2, C3k2, [256, False, 0.25]]

  - [-1, 1, SADEConv, [256, 3, 2, softmax, 1.0]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]

  - [-1, 1, Conv, [512, 3, 2]]                         # 5S-P4/16
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [1024, 3, 2]]                        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]

  - [-1, 1, SPPF, [1024, 5]]                           # 9
  - [-1, 2, C2PSA, [1024]]                             # 10



head:
  # top-down layer3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11: P5 -> P4
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 2, C3k2, [512, False]]                 # 13

  # top-down layer2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14: P4 -> P3
  - [[-1, 4], 1, Concat, [1]]                   # 15
  - [-1, 2, C3k2, [256, False]]                 # 16

  # top-down layer1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17: P3 -> P2
  - [[-1, 2], 1, Concat, [1]]                   # 18
  - [-1, 2, C3k2, [128, False]]                 # 19

  # Bottom-up layer1
  - [-1, 1, Conv, [128, 3, 2]]                  # 20: P2 -> P3
  - [[-1, 16], 1, Concat, [1]]                  # 21
  - [-1, 2, C3k2, [256, False]]                 # 22  # P3

  # Bottom-up layer2
  - [-1, 1, Conv, [256, 3, 2]]                  # 23: P3 -> P4
  - [[-1, 13], 1, Concat, [1]]                  # 24
  - [-1, 2, C3k2, [512, False]]                 # 25  # P4


  # Detect heads (P1, P2, P3)
  - [[19, 22, 25], 1, RDC_Head, [nc]]            # 27