# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  - [-1, 1, RFAConv, [64, 3, 2]]        # 0
  - [-1, 1, RFAConv, [128, 3, 2]]       # 1
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, RFAConv, [256, 3, 2]]       # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4 (skip-1 source)
  - [-1, 1, RFAConv, [512, 3, 2]]       # 5
  - [-1, 2, C3k2, [512, True]]          # 6 (skip-2 source)
  - [-1, 1, RFAConv, [1024, 3, 2]]      # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10


# YOLO11n head
head:
  - [[2, 4, 6, 10], 1, NASFPN, [64, 1, 5, 0.05, 3]]   # out=64, stack=1, drop_prob=0.05, block=3

  - [11, 1, Index, [64, 0]]                           # P2
  - [11, 1, Index, [64, 1]]                           # P3
  - [11, 1, Index, [64, 2]]                           # P4

  - [[12, 13, 14], 1, Detect, [nc]]
